app/controllers/games_controller.rb

  def index
    @games = Game.all
---
SELECT * FROM "games"

  def show
    @game = Game.find(params[:id])
---
SELECT * FROM "games" WHERE ("games"."id" = 1)

  def score_entry
    @game = Game.find(params[:id])
---
SELECT * FROM "games" WHERE ("games"."id" = 1)

  def edit
    @game = Game.find(params[:id])
---
SELECT * FROM "games" WHERE ("games"."id" = 1)

  def create
    @game = Game.new(params[:game])

    respond_to do |format|
      if @game.save
---
INSERT INTO "games" ("name", "created_at", "updated_at", "entry_split", "entry_order", "short_name", "scoreboard_template") VALUES('Ketsui', '2010-05-03 03:49:13', '2010-05-03 03:49:13', '-', 'player,score,stage,ship,version', 'ketsui', '{{player}} - {{score}} - {{stage}} - {{ship}} - {{version}}')

  def update
    @game = Game.find(params[:id])

    respond_to do |format|
      if @game.update_attributes(params[:game])
---
SELECT * FROM "games" WHERE ("games"."id" = 1)
UPDATE "games" SET "updated_at" = '2010-05-19 02:03:43', "current_columns" = 'player,version' WHERE "id" = 1