app/controllers/scoreentries_controller.rb

  def index
    if params[:game_id]
      @game = Game.find(params[:game_id])
---
SELECT * FROM "games" WHERE ("games"."id" = 1)

  def edit
    @game = Game.find(params[:game_id])
---
SELECT * FROM "games" WHERE ("games"."id" = 1)

  def update
    @game = Game.find(params[:game_id])
---
SELECT * FROM "games" WHERE ("games"."id" = 1)